app/views/post_images/show.html.erb

          <span><i class="fa fa-calendar"></i> <%= @post_image.created_at.strftime('%Y/%m/%d') %> ｜ </span>
          <span><i class="fa fa-comment"></i> <%= link_to "#{@post_image.post_comments.count}", post_image_path(@post_image.id), class:"text-dark" %> ｜ </span>
---
SELECT "post_comments".* FROM "post_comments" WHERE "post_comments"."post_image_id" = ?  [["post_image_id", 1]]
SELECT COUNT(*) FROM "post_comments" WHERE "post_comments"."post_image_id" = ?  [["post_image_id", 3]]

              <%= link_to(post_image_favorites_path(@post_image), class:"text-dark", method: :delete) do %>
                <i class="fa fa-heart" aria-hidden="true"></i> <%= @post_image.favorites.count %>
---
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."post_image_id" = ?  [["post_image_id", 3]]

              <%= link_to(post_image_favorites_path(@post_image), class:"text-dark", method: :post) do %>
                <i class="fa fa-heart" aria-hidden="true"></i> <%= @post_image.favorites.count %>
---
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."post_image_id" = ?  [["post_image_id", 3]]

      <div class="comments card-text">
        <h4 class="mt-3"><%= @post_image.post_comments.count %>件コメント</h4>
        <% @post_image.post_comments.each do |post_comment| %>
---
SELECT COUNT(*) FROM "post_comments" WHERE "post_comments"."post_image_id" = ?  [["post_image_id", 3]]
SELECT "post_comments".* FROM "post_comments" WHERE "post_comments"."post_image_id" = ?  [["post_image_id", 3]]